In [1]:
import numpy as np
import pandas as pd

In [2]:
dic = {"Name": ["Ajay", "Raju", "Mayur", "Rahul"],
      'Marks': ['95', '60', '55', '60'],
      'City': ['Mumbai', 'Nagpur', 'Pune', 'Bhusawal']}

In [3]:
df = pd.DataFrame(dic)

In [4]:
df

    Name Marks      City
0   Ajay    95    Mumbai
1   Raju    60    Nagpur
2  Mayur    55      Pune
3  Rahul    60  Bhusawal

In [5]:
df.to_csv('Friends.csv')

In [6]:
df.shape

(4, 3)

In [7]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
df.columns

Index(['Name', 'Marks', 'City'], dtype='object')

In [9]:
df.info (2)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Marks   4 non-null      object
 2   City    4 non-null      object
dtypes: object(3)
memory usage: 224.0+ bytes

In [10]:
df.head

<bound method NDFrame.head of     Name Marks      City
0   Ajay    95    Mumbai
1   Raju    60    Nagpur
2  Mayur    55      Pune
3  Rahul    60  Bhusawal>

In [11]:
df.head(2)

   Name Marks    City
0  Ajay    95  Mumbai
1  Raju    60  Nagpur

In [12]:
df.tail(3)

    Name Marks      City
1   Raju    60    Nagpur
2  Mayur    55      Pune
3  Rahul    60  Bhusawal

In [14]:
d = np. zeros ((3,4))

In [15]:
d

array([[0., 0., 0., 0.],
       [0., 0., 0., 0.],
       [0., 0., 0., 0.]])

In [ ]:
df.to_csv('Friends.csv')